snake = '38.2'  # Длина Питона в попугаях
length = 6.5  # Количество Питонов, которых можно уложить вдоль вагона.

# Напишите формулу для вычисления количества попугаев
result = int(float(snake) * length)

print('В вагоне можно положить в ряд', result, 'попугаев')